## <b>■ 그룹연산</b>
    1. df.groupby
    2. group.함수()
    3. group.agg

### <b>■ 그룹객체.agg</b>
    문법
        group.agg(매핑함수)

    예제. 
```SQL
select deptno, sum(sal)
    from emp
    group by deptno;
```

In [3]:
import pandas as pd
emp = pd.read_csv('emp.csv')

df = emp[['sal','deptno']]

gp = df.groupby('deptno')
gp.agg(sum)

          sal
deptno
10       8750
20      10875
30       9400

### ※ 문제213. 아래의 SQL을 Pandas로 구현하시오
```sql
select deptno, job, sum(sal)
    from emp
    group by deptno, job
    order by deptno, job;
```

In [9]:
import pandas as pd
emp = pd.read_csv('emp.csv')
df = emp[['deptno','job','sal']]
gp = df.groupby(['deptno','job'])

gp.agg(sum).sort_values(by=['deptno','job'],ascending=True)

                   sal
deptno job
10     CLERK      1300
       MANAGER    2450
       PRESIDENT  5000
20     ANALYST    6000
       CLERK      1900
       MANAGER    2975
30     CLERK       950
       MANAGER    2850
       SALESMAN   5600

### ※ 문제214. 아래의 SQL을 Pandas로 구현하시오
```sql
select deptno, min(sal), max(sal)
    from emp
    group by deptno;
```

In [10]:
import pandas as pd
emp = pd.read_csv('emp.csv')
df = emp[['deptno','sal']]
gp = df.groupby('deptno')
gp.agg([min,max])

         sal
         min   max
deptno
10      1300  5000
20       800  3000
30       950  2850

### ※ 문제215. Kaggle 타이타닉의 클래스별 운임의 최대값과 최소값을 아래와 같이 출력하시오
            Fare
            min       max
    Pclass
    1       0.0       512.3292
    2       0.0        73.5000
    3       0.0        69.5500

In [12]:
import pandas as pd
tit = pd.read_csv('train.csv')
df = tit[['Pclass','Fare']]
gp = df.groupby(['Pclass'])
gp.agg([min,max])

       Fare
        min       max
Pclass
1       0.0  512.3292
2       0.0   73.5000
3       0.0   69.5500

## <b>■ 그룹연산</b>
    1. df.groupby
    2. group.함수()
    3. group.agg
    4. group.filter(조건식 함수)
    
### <b>■ group.filter(조건식 함수)</b>
    그룹객체에 filter() 메소드를 적용할 때 조건식을 가진 함수를 전달하면 조건이 참인 그룹만을 남긴다.
    문법
        group.filter(조건식 함수)

##### 예제. 부서번호별 평균월급이 2000보다 작은 사원들의 이름, 월급, 직업, 부서번호를 출력
```sql
select ename, sal, job, 부서평균
    from (
            select ename, sal, job, deptno, avg(sal) over (partition by deptno) 부서평균
                from emp
         )
    where 부서평균 < 2000;
```

In [18]:
import pandas as pd
emp = pd.read_csv('emp.csv')
df = emp[['ename','sal','job','deptno']]
gp = df.groupby('deptno')
gp.filter(lambda x:x.sal.mean()<2000)

    ename   sal       job  deptno
1   BLAKE  2850   MANAGER      30
4  MARTIN  1250  SALESMAN      30
5   ALLEN  1600  SALESMAN      30
6  TURNER  1500  SALESMAN      30
7   JAMES   950     CLERK      30
8    WARD  1250  SALESMAN      30

## <b>■ 그룹연산</b>
    1. df.groupby
    2. group.함수()
    3. group.agg
    4. group.filter(조건식 함수)
    5. group.apply(매핑 함수)
    
### <b>■ group.apply</b>
    apply() 메소드는 Pandas 객체의 개별원소를 특정함수에 일대일매핑
    문법
        group.apply(매핑함수)

In [19]:
import pandas as pd
tit = pd.read_csv('train.csv')
df = tit[['Name','Survived','Age','Pclass','Fare']]
gp = df.groupby('Pclass')
rs = gp.apply(lambda x:x.describe())
rs

                Survived         Age  Pclass        Fare
Pclass
1      count  216.000000  186.000000   216.0  216.000000
       mean     0.629630   38.233441     1.0   84.154687
       std      0.484026   14.802856     0.0   78.380373
       min      0.000000    0.920000     1.0    0.000000
       25%      0.000000   27.000000     1.0   30.923950
       50%      1.000000   37.000000     1.0   60.287500
       75%      1.000000   49.000000     1.0   93.500000
       max      1.000000   80.000000     1.0  512.329200
2      count  184.000000  173.000000   184.0  184.000000
       mean     0.472826   29.877630     2.0   20.662183
       std      0.500623   14.001077     0.0   13.417399
       min      0.000000    0.670000     2.0    0.000000
       25%      0.000000   23.000000     2.0   13.000000
       50%      0.000000   29.000000     2.0   14.250000
       75%      1.000000   36.000000     2.0   26.000000
       max      1.000000   70.000000     2.0   73.500000
3      count  491.000000  355.000000   491.0  491.000000
       mean     0.242363   25.140620     3.0   13.675550
       std      0.428949   12.495398     0.0   11.778142
       min      0.000000    0.420000     3.0    0.000000
       25%      0.000000   18.000000     3.0    7.750000
       50%      0.000000   24.000000     3.0    8.050000
       75%      0.000000   32.000000     3.0   15.500000
       max      1.000000   74.000000     3.0   69.550000